app/controllers/event_listings_controller.rb

  def index
    @event_listings = EventListing.all
---
SELECT "event_listings".* FROM "event_listings"